Revit 2024 API
Connector.Flow Property
 The flow of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double Flow { get; }
Visual Basic
Public ReadOnly Property Flow As Double
	Get
Visual C++
public:
property double Flow {
	double get ();
}
Remarks
 Instantaneous flow at this connector, calculated according to system.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This connector does not support flow calculation and associated properties.
See Also
Connector Class
Autodesk.Revit.DB Namespace